nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe31b/driver_examples/flexio/uart/int_rb_transfer/pin_mux.c
/*
 * Copyright 2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
 
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/
#include "fsl_common.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{
  const  siul2_pin_settings_t pin_pta31_config =
  {
      .base                        = SIUL2,
      .pinPortIdx                  = 31u,
      .mux                         = kPORT_MUX_ALT3,
      .safeMode                    = kPORT_SAFE_MODE_DISABLED,
      .inputFilter                 = kPORT_INPUT_FILTER_DISABLED,
      .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
      .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
      .invert                      = kPORT_INVERT_DISABLED,
      .inputBuffer                 = kPORT_INPUT_BUFFER_DISABLED,
      .outputBuffer                = kPORT_OUTPUT_BUFFER_ENABLED,
      .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
      .initValue                   = 2u,
  };

  SIUL2_PinInit(&pin_pta31_config);

  const  siul2_pin_settings_t pin_ptb18_config =
  {
      .base                        = SIUL2,
      .pinPortIdx                  = 50u,
      .mux                         = kPORT_MUX_AS_GPIO,
      .safeMode                    = kPORT_SAFE_MODE_DISABLED,
      .inputFilter                 = kPORT_INPUT_FILTER_DISABLED,
      .pullConfig                  = kPORT_INTERNAL_PULL_NOT_ENABLED,
      .pullKeep                    = kPORT_PULL_KEEP_DISABLED,
      .invert                      = kPORT_INVERT_DISABLED,
      .inputBuffer                 = kPORT_INPUT_BUFFER_ENABLED,
      .outputBuffer                = kPORT_OUTPUT_BUFFER_DISABLED,
      .adcInterleaves              = { kMUX_MODE_NOT_AVAILABLE, kMUX_MODE_NOT_AVAILABLE },
      .inputMuxReg                 = {
                                       153u
                                     },
      .inputMux                    = { 
                                       kPORT_INPUT_MUX_ALT6,
                                       kPORT_INPUT_MUX_NO_INIT,
                                       kPORT_INPUT_MUX_NO_INIT,
                                       kPORT_INPUT_MUX_NO_INIT,
                                       kPORT_INPUT_MUX_NO_INIT,
                                       kPORT_INPUT_MUX_NO_INIT,
                                       kPORT_INPUT_MUX_NO_INIT,
                                       kPORT_INPUT_MUX_NO_INIT,
                                       kPORT_INPUT_MUX_NO_INIT,
                                       kPORT_INPUT_MUX_NO_INIT,
                                       kPORT_INPUT_MUX_NO_INIT,
                                       kPORT_INPUT_MUX_NO_INIT,
                                       kPORT_INPUT_MUX_NO_INIT,
                                       kPORT_INPUT_MUX_NO_INIT,
                                       kPORT_INPUT_MUX_NO_INIT,
                                       kPORT_INPUT_MUX_NO_INIT
                                     },
      .initValue                   = 2u,
  };

  SIUL2_PinInit(&pin_ptb18_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
